// lib/data/flower_data.dart
import 'package:app/models/flower.dart';
 // เปลี่ยน 'flutter_app' เป็นชื่อโปรเจกต์ของคุณ

List<Flower> plantList = [
  Flower(
      name: 'ต้นพลูด่าง',
      details:
          '\nแสง \n •    ชอบแสงแดดรำไร หรือแสงสว่างแบบอ้อม \n •    ไม่ควรโดนแดดจัดโดยตรง เพราะใบอาจไหม้ได้ \nน้ำ \n •    รดน้ำ 2-3 ครั้งต่อสัปดาห์ หรือเมื่อดินเริ่มแห้ง \nดิน \n •    ใช้ดินร่วนซุยที่ระบายน้ำดี ผสมดินปลูกกับกาบมะพร้าวสับหรือทรายหยาบ \nปุ๋ย \n •    ใส่ปุ๋ยละลายช้าเดือนละครั้ง หรือใช้ปุ๋ยน้ำสัปดาห์ละครั้งเพื่อให้ใบเขียวสวย',
      temperature:
          '\n •    อยู่ในช่วง 18-30°C -ไม่ชอบอากาศหนาวต่ำกว่า 10°C เพราะอาจทำให้ใบเหลืองหรือชะงักการเติบโต',
      humidity:
          '\n •    ชอบความชื้นปานกลางถึงสูง (ประมาณ 50-70% RH) -ถ้าปลูกในห้องแอร์ ควรหมั่นรดน้ำและเช็ดใบเพื่อป้องกันใบแห้ง'),
  Flower(
      name: 'กระบองเพชร',
      details:
          '\nแสง \n •    ต้องการแสงแดดจัด อย่างน้อย 4-6 ชั่วโมงต่อวัน \n •    หากปลูกในร่ม ควรตั้งไว้ใกล้หน้าต่างที่มีแสงแดดส่องถึง หรือใช้ไฟปลูกต้นไม้เสริม,\nน้ำ \n •    ควรรดน้ำเมื่อดินแห้งสนิท (ปกติสัปดาห์ละครั้งหรือสองครั้ง ขึ้นอยู่กับอากาศ) \n •    ฤดูหนาวควรรดน้ำน้อยลง หรือหยุดรดน้ำไปเลยถ้าอากาศเย็นจัด \n •    อย่ารดน้ำมากเกินไป เพราะรากอาจเน่าได้,\nดิน \n •    ใช้ดินสำหรับกระบองเพชรหรือดินร่วนผสมทราย เพื่อให้ระบายน้ำได้ดี,\nปุ๋ย \n •    ใส่ปุ๋ยสูตรสำหรับกระบองเพชร เดือนละครั้ง ในช่วงที่ต้นกำลังเติบโต (ฤดูร้อน-ฤดูฝน) \n •    ลดหรือหยุดใส่ปุ๋ยในช่วงฤดูหนาว',
      temperature:
          '\n •    อยู่ในช่วง 18-35°C \n •    ทนความร้อนได้สูง แต่ไม่ชอบอากาศเย็นต่ำกว่า 10°C \n •    หากอุณหภูมิต่ำเกินไป อาจทำให้ต้นชะงักการเจริญเติบโตหรือใบเหี่ยว',
      humidity:
          '\n •    อยู่ในช่วง 30-50% RH \n •    ไม่ชอบความชื้นสูง เพราะอาจทำให้รากเน่า \n •    ควรปลูกในที่ที่อากาศถ่ายเทดี ไม่ควรปลูกในห้องที่อับหรือมีความชื้นสูง'),
  Flower(
      name: 'ต้นกะเพรา',
      details:
          '\nแสง\n •    ต้องการแสงแดดเต็มวันอย่างน้อย 6-8 ชั่วโมงต่อวัน\n •    หากปลูกในที่ร่มหรือแสงน้อย อาจทำให้ต้นแคระแกร็นและใบไม่ดก\nดิน\n •    ใช้ดินร่วนซุยหรือดินปนทรายที่ระบายน้ำได้ดี\n •    ควรปรับปรุงดินด้วยปุ๋ยคอกหรือปุ๋ยหมักก่อนปลูก\nน้ำ\n •    ควรรดน้ำวันละ 1-2 ครั้งในช่วงเช้าหรือเย็น\n •    หลีกเลี่ยงการรดน้ำมากเกินไป เพราะอาจทำให้รากเน่า\nปุ๋ย\n •    ใส่ปุ๋ยคอกหรือปุ๋ยอินทรีย์ทุก 2-3 สัปดาห์\n •    สามารถใช้ปุ๋ยสูตรเสมอ (เช่น 15-15-15) เพื่อเร่งการเติบโต',
      temperature:
          '\n •    อุณหภูมิที่เหมาะสม 25-35°C\n •    ทนร้อนและชื้นได้ดี แต่ไม่ชอบอากาศหนาวต่ำกว่า 15°C',
      humidity:
          '\n    •    ความชื้นที่เหมาะสมอยู่ในช่วง 50-70%\n    •    กะเพราเป็นพืชที่ทนแล้งได้ดี แต่ถ้าความชื้นสูงเกินไป อาจทำให้เกิดเชื้อราและรากเน่า'),
];

List<Flower> flowerList = [
  Flower(
      name: 'ดอกเดซี่',
      details:
          '\nแสงแดด\n •    เดซี่ต้องการแสงแดดเต็มวัน หรืออย่างน้อย 4-6 ชั่วโมงต่อวัน\n •    หากปลูกในที่ร่ม ควรเป็นที่ที่มีแสงแดดรำไร\n •    หลีกเลี่ยงที่ร่มทึบ เพราะจะทำให้ต้นแคระแกร็นและไม่ออกดอก\n\nน้ำ\n •    รดน้ำวันละ 1 ครั้งในช่วงเช้า หรือ วันเว้นวัน หากดินยังชื้นอยู่\n •    ในช่วงอากาศร้อนจัด อาจรดน้ำวันละ 2 ครั้ง (เช้า-เย็น)\n •    หลีกเลี่ยงการรดน้ำมากเกินไป เพราะอาจทำให้รากเน่า\n\nดิน\n •    ใช้ดินร่วนซุย ที่ระบายน้ำได้ดี เช่น ดินผสมปุ๋ยหมัก ดินใบก้ามปู หรือดินผสมทราย\n •    หากปลูกในกระถาง ควรมีรูระบายน้ำเพื่อป้องกันน้ำขัง\n •    ควรปรับดินให้ร่วนก่อนปลูก และใส่ปุ๋ยรองพื้นเพื่อให้สารอาหารเพียงพอ\n\nปุ๋ย\n •    ใส่ ปุ๋ยคอกหรือปุ๋ยหมัก เดือนละครั้ง เพื่อบำรุงดิน\n •    ใช้ปุ๋ยละลายน้ำที่มีธาตุอาหารครบถ้วนทุก 2-3 สัปดาห์\n •    หากต้องการกระตุ้นการออกดอก ควรใช้ ปุ๋ยที่มีฟอสฟอรัส (P) สูง\n',
      temperature:
          '\n •    เดซี่เติบโตได้ดีในอุณหภูมิ 15-25°C\n •    ไม่ทนต่ออากาศร้อนจัด (เกิน 30°C) หรือหนาวจัด (ต่ำกว่า 5°C)\n •    หากอากาศร้อนมาก อาจต้องย้ายต้นไปไว้ในที่ร่มบางช่วงของวัน\n',
      humidity:
          '\n •    เดซี่ชอบความชื้นปานกลาง (ประมาณ 50-70%)\n •    หากอากาศแห้งเกินไป อาจพ่นละอองน้ำรอบต้นเพื่อเพิ่มความชื้น\n •    ควรปลูกในที่ที่มีอากาศถ่ายเทดี เพื่อลดความเสี่ยงของโรคเชื้อรา'),
  Flower(
      name: 'กล้วยไม้',
      details:
          '\nแสงแดด\n •    กล้วยไม้ชอบ แสงแดดรำไร หรือ แสงแดดอ่อนในช่วงเช้า (4-6 ชั่วโมง/วัน)\n •    หลีกเลี่ยงแสงแดดจัดโดยตรง โดยเฉพาะในช่วงบ่าย เพราะอาจทำให้ใบไหม้\n •    สามารถปลูกใต้ร่มไม้หรือใช้ซาแรนพรางแสงประมาณ 50-70%\n\nน้ำ\n •    ควรรดน้ำ 2-3 ครั้ง/สัปดาห์ หรือเมื่อวัสดุปลูกเริ่มแห้ง\n •    ในช่วงหน้าร้อน อาจต้องรดน้ำ วัน ละ 1 ครั้ง ในช่วงเช้า\n •    หลีกเลี่ยงการรดน้ำจนขัง เพราะอาจทำให้รากเน่า\n\nดินและวัสดุปลูก\n •    กล้วยไม้ไม่ต้องการดินทั่วไป แต่ต้องใช้วัสดุปลูกที่โปร่งและระบายน้ำดี เช่น กาบมะพร้าวสับ,ถ่านไม้,เปลือกไม้,มอสสแฟกนัม\n •    ควรเปลี่ยนวัสดุปลูกทุก 6-12 เดือน เพื่อป้องกันการสะสมของเชื้อโรค\n\nปุ๋ย\n •    ควรใส่ปุ๋ยละลายน้ำสูตรเสมอ (เช่น 20-20-20) ทุก 1-2 สัปดาห์\n •    ถ้าต้องการกระตุ้นการออกดอก ให้ใช้ปุ๋ยที่มี ฟอสฟอรัส (P) สูง เช่น 10-30-20\n •    สามารถใช้ปุ๋ยออสโมโค้ทหรือปุ๋ยละลายช้า เพื่อบำรุงต้นระยะยาว',
      temperature:
          '\n •    อุณหภูมิที่เหมาะสม 18-30°C\n •    ควรหลีกเลี่ยงอุณหภูมิต่ำกว่า 10°C หรือสูงเกิน 35°C',
      humidity:
          '\n •    กล้วยไม้ต้องการความชื้นสัมพัทธ์ 50-80%\n •    หากอากาศแห้งเกินไป สามารถเพิ่มความชื้นโดย วางถาดน้ำใต้ต้นไม้,ใช้เครื่องพ่นไอน้ำ,ฉีดพ่นละอองน้ำบางๆ รอบต้น แต่ไม่ควรให้ขังตามใบ'),
  Flower(
      name: 'ดอกกุหลาบ',
      details:
          '\nแสง\n •    ต้องการแสงแดด อย่างน้อย 6 ชั่วโมงต่อวัน\n •    หากปลูกในที่ร่มหรือแสงน้อย อาจทำให้ต้นไม่แข็งแรงและออกดอกน้อย\n\nดิน\n •    ใช้ดินร่วนซุยที่ระบายน้ำดี ผสมปุ๋ยคอกหรือปุ๋ยหมักเพื่อเพิ่มธาตุอาหาร\n •    ค่าความเป็นกรด-ด่างของดินที่เหมาะสมอยู่ระหว่าง 6.0-6.5\n\nน้ำ\n •    ควรรดน้ำ วัน ละครั้งในตอนเช้า หรือ 2-3 วันครั้งในช่วงอากาศเย็น\n •    ไม่ควรรดน้ำตอนเย็นหรือกลางคืน เพราะอาจทำให้เกิดเชื้อรา\n •    หลีกเลี่ยงการรดน้ำที่ใบและดอก เพราะอาจทำให้ใบเหลืองและเป็นโรค\n\nปุ๋ย\n •    ใช้ปุ๋ยอินทรีย์ เช่น ปุ๋ยคอกหรือปุ๋ยหมัก ทุก 2-3 สัปดาห์\n •    ใช้ปุ๋ยเคมีสูตรเร่งดอก (8-24-24 หรือ 10-52-17) ทุก 1-2 เดือน',
      temperature: '\n •    อุณหภูมิที่เหมาะสมอยู่ที่ 18-30°C',
      humidity:
          '\n    •    ความชื้นที่เหมาะสมอยู่ที่ 50-70%\n    •    หากอากาศร้อนจัด ควรเพิ่มความชื้นโดยพ่นละอองน้ำรอบ ๆ ต้น แต่ไม่ควรฉีดพ่นที่ใบโดยตรง'),
];
